bench/results/machine1/scotty-0.8.2/DEEP.log
/home/philopon/bench-0.1.0/wrk/wrk
Benchmarking DEEP
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   254.56ms  259.89ms   7.38s    79.53%
    Req/Sec   382.31    266.62     1.29k    51.38%
  78785 requests in 30.01s, 11.12MB read
  Socket errors: connect 0, read 0, write 0, timeout 246
Requests/sec:   2625.49
Transfer/sec:    379.46KB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   432.45ms  472.49ms   1.24s    71.24%
    Req/Sec   393.26    332.08     1.26k    51.18%
  78219 requests in 30.00s, 11.04MB read
  Socket errors: connect 0, read 0, write 0, timeout 263
Requests/sec:   2606.91
Transfer/sec:    376.78KB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   377.51ms  388.67ms   2.20s    71.63%
    Req/Sec   390.01    324.52     1.23k    51.43%
  78091 requests in 30.01s, 11.02MB read
  Socket errors: connect 0, read 0, write 0, timeout 263
Requests/sec:   2602.55
Transfer/sec:    376.15KB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   352.09ms  349.74ms   4.47s    71.77%
    Req/Sec   387.50    320.60     1.24k    51.07%
  78265 requests in 30.01s, 11.05MB read
  Socket errors: connect 0, read 0, write 0, timeout 239
Requests/sec:   2608.26
Transfer/sec:    376.97KB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   392.26ms  400.04ms   2.98s    70.27%
    Req/Sec   389.30    332.11     1.21k    48.93%
  78378 requests in 30.01s, 11.06MB read
  Socket errors: connect 0, read 0, write 0, timeout 253
Requests/sec:   2612.01
Transfer/sec:    377.52KB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   321.67ms  334.47ms   1.53s    75.79%
    Req/Sec   391.44    302.24     1.26k    52.75%
  78390 requests in 30.01s, 11.06MB read
  Socket errors: connect 0, read 0, write 0, timeout 271
Requests/sec:   2611.75
Transfer/sec:    377.48KB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   299.83ms  332.71ms   2.48s    78.95%
    Req/Sec   386.69    274.27     1.43k    57.09%
  78230 requests in 30.01s, 11.04MB read
  Socket errors: connect 0, read 0, write 0, timeout 277
Requests/sec:   2606.85
Transfer/sec:    376.77KB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   494.22ms  495.83ms   8.65s    64.12%
    Req/Sec   401.13    379.97     1.33k    46.07%
  78365 requests in 30.01s, 11.06MB read
  Socket errors: connect 0, read 0, write 0, timeout 307
Requests/sec:   2611.45
Transfer/sec:    377.44KB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   357.94ms  368.92ms   4.62s    71.71%
    Req/Sec   384.60    323.06     1.27k    50.92%
  78298 requests in 30.01s, 11.05MB read
  Socket errors: connect 0, read 0, write 0, timeout 247
Requests/sec:   2609.42
Transfer/sec:    377.14KB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   367.73ms  367.34ms   7.45s    70.36%
    Req/Sec   385.21    327.69     1.26k    50.31%
  78191 requests in 30.01s, 11.04MB read
  Socket errors: connect 0, read 0, write 0, timeout 237
Requests/sec:   2605.86
Transfer/sec:    376.63KB
=================== summary ===================
bench target: scotty
bench mode:   30s * 10
average:      2610.06
stdev:        6.19