bench/results/machine1/scotty-0.8.2/PARAM.log
/home/philopon/bench-0.1.0/wrk/wrk
Benchmarking PARAM
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.17ms    6.03ms 612.09ms   98.36%
    Req/Sec     2.98k   611.20     5.87k    62.33%
  695877 requests in 30.00s, 98.88MB read
Requests/sec:  23192.29
Transfer/sec:      3.30MB
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.99ms   26.51ms 873.80ms   99.86%
    Req/Sec     2.97k   657.84     6.45k    80.93%
  694408 requests in 30.00s, 98.67MB read
  Socket errors: connect 0, read 0, write 0, timeout 3
Requests/sec:  23145.16
Transfer/sec:      3.29MB
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.23ms   29.50ms 822.22ms   99.86%
    Req/Sec     2.99k   693.55     6.79k    82.65%
  691852 requests in 30.00s, 98.31MB read
Requests/sec:  23058.45
Transfer/sec:      3.28MB
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.13ms    6.64ms 971.66ms   97.75%
    Req/Sec     2.99k   670.17     6.60k    74.54%
  694042 requests in 30.00s, 98.62MB read
Requests/sec:  23135.26
Transfer/sec:      3.29MB
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.61ms   17.02ms 609.88ms   99.78%
    Req/Sec     3.01k   716.17     6.84k    82.26%
  697140 requests in 30.00s, 99.06MB read
Requests/sec:  23235.73
Transfer/sec:      3.30MB
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.15ms    7.00ms 911.23ms   97.67%
    Req/Sec     2.99k   561.54     7.39k    85.89%
  691940 requests in 30.00s, 98.32MB read
Requests/sec:  23062.62
Transfer/sec:      3.28MB
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.72ms   60.04ms   1.00s    99.35%
    Req/Sec     2.97k   732.75     8.73k    85.95%
  688018 requests in 30.00s, 97.77MB read
  Socket errors: connect 0, read 0, write 0, timeout 12
Requests/sec:  22931.79
Transfer/sec:      3.26MB
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.97ms  102.01ms   1.02s    97.26%
    Req/Sec     3.02k     0.95k    8.21k    85.08%
  697938 requests in 30.00s, 99.18MB read
Requests/sec:  23261.56
Transfer/sec:      3.31MB
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.54ms   56.72ms 899.28ms   99.28%
    Req/Sec     3.00k   603.60     8.19k    87.18%
  693658 requests in 30.00s, 98.57MB read
Requests/sec:  23119.80
Transfer/sec:      3.29MB
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    20.67ms   43.85ms 983.42ms   99.27%
    Req/Sec     3.02k   607.84     8.53k    88.33%
  694694 requests in 30.00s, 98.71MB read
Requests/sec:  23154.37
Transfer/sec:      3.29MB
=================== summary ===================
bench target: scotty
bench mode:   30s * 10
average:      23129.70
stdev:        95.61